app/views/personagens/show.html.erb

SELECT "poderes".* FROM "poderes" WHERE "poderes"."personagem_id" = ?  [["personagem_id", 1]]
---
      <tbody>
        <% @personagem.poderes.each do |poder| %>